[Language]
Main_Title=شكرا لاختيارك EaseUS Data Recovery Wizard
Sub_Title=كيف يمكنك تقييم تجربتك الشاملة ؟
Terrible=الرهيبه
Poor=الفقراء
Good=جيده
Great=كبيره
Excellent=ممتازة
Never_Ask_Again=لا تسال مره أخرى
Rate_Now=معدل الآن
Feedback_Text_Tips=يرجى ترك ملاحظاتك هنا.
Feedback_Length_Tips= لقد دخل أكثر من 500 رسالة. يرجى إرسال بريد إلكتروني إلى المزيد من الردود support@easeus.com.